Repository: GPCracker/AdvancedAimingSystem
Catalog: resource/localizations/*/AdvancedAimingSystem.po
Languages: ru_ru

# appSuccessMessage
source: <a href='event:AdvancedAimingSystem.official_topic'><font color='#0080FF'>"Advanced&nbsp;Aiming&nbsp;System"</font></a> <font color='#008000'>was successfully loaded.</font>
ru_ru: <a href='event:AdvancedAimingSystem.official_topic'><font color='#0080FF'>"Улучшенная&nbsp;система&nbsp;прицеливания" (AdvancedAimingSystem)</font></a> <font color='#008000'>успешно загружена.</font>

# appWarningMessage
source: <a href='event:AdvancedAimingSystem.official_topic'><font color='#0080FF'>"Advanced&nbsp;Aiming&nbsp;System"</font></a> <font color='#E00000'>was not tested with current client version.</font>
ru_ru: <a href='event:AdvancedAimingSystem.official_topic'><font color='#0080FF'>"Улучшенная&nbsp;система&nbsp;прицеливания" (AdvancedAimingSystem)</font></a> <font color='#E00000'>не была протестирована с текущей версией клиента.</font>

# targetScanner/autoScan/onActivate
source: [TargetScanner] AutoMode ENABLED.
ru_ru: [СКАНЕР] АВТОРЕЖИМ АКТИВИРОВАН.

# targetScanner/autoScan/onDeactivate
source: [TargetScanner] AutoMode DISABLED.
ru_ru: [СКАНЕР] АВТОРЕЖИМ ДЕАКТИВИРОВАН.

# arcadeAimCorrection/targetMode/onActivate
source: [ArcadeAimCorrection] TargetMode ENABLED.
ru_ru: [ДАЛЬНОМЕР] АРКАДНЫЙ по цели АКТИВИРОВАН.

# arcadeAimCorrection/targetMode/onDeactivate
source: [ArcadeAimCorrection] TargetMode DISABLED.
ru_ru: [ДАЛЬНОМЕР] АРКАДНЫЙ по цели ДЕАКТИВИРОВАН.

# sniperAimCorrection/targetMode/onActivate
source: [SniperAimCorrection] TargetMode ENABLED.
ru_ru: [ДАЛЬНОМЕР] СНАЙПЕРСКИЙ по цели АКТИВИРОВАН.

# sniperAimCorrection/targetMode/onDeactivate
source: [SniperAimCorrection] TargetMode DISABLED.
ru_ru: [ДАЛЬНОМЕР] СНАЙПЕРСКИЙ по цели ДЕАКТИВИРОВАН.

# strategicAimCorrection/targetMode/onActivate
source: [StrategicAimCorrection] TargetMode ENABLED.
ru_ru: [ДАЛЬНОМЕР] СТРАТЕГИЧЕСКИЙ по цели АКТИВИРОВАН.

# strategicAimCorrection/targetMode/onDeactivate
source: [StrategicAimCorrection] TargetMode DISABLED.
ru_ru: [ДАЛЬНОМЕР] СТРАТЕГИЧЕСКИЙ по цели ДЕАКТИВИРОВАН.

# artyAimCorrection/targetMode/onActivate
source: [ArtyAimCorrection] TargetMode ENABLED.
ru_ru: [ДАЛЬНОМЕР] БАЛЛИСТИЧЕСКИЙ по цели АКТИВИРОВАН.

# artyAimCorrection/targetMode/onDeactivate
source: [ArtyAimCorrection] TargetMode DISABLED.
ru_ru: [ДАЛЬНОМЕР] БАЛЛИСТИЧЕСКИЙ по цели ДЕАКТИВИРОВАН.

# safeShot/onActivate
source: [SafeShot] ENABLED.
ru_ru: [ПРЕДОХРАНИТЕЛЬ] АКТИВИРОВАН.

# safeShot/onDeactivate
source: [SafeShot] DISABLED.
ru_ru: [ПРЕДОХРАНИТЕЛЬ] ДЕАКТИВИРОВАН.

# safeShot/error/template
source: [{reason}] Shot has been blocked.
ru_ru: [{reason}] Выстрел заблокирован предохранителем.

# safeShot/reasons/team/chat/message
source: {player} ({vehicle}), you're in my line of fire!
ru_ru: {player} ({vehicle}), не мешай стрелять!

# safeShot/reasons/team/template
source: friendly
ru_ru: союзник

# safeShot/reasons/dead/template
source: corpse
ru_ru: труп

# safeShot/reasons/waste/template
source: waste
ru_ru: промах

# gui/panels/context/hideInfoPanel
source: Hide this panel
ru_ru: Спрятать эту панель

# gui/panels/context/resetInfoPanel
source: Reset ingame settings
ru_ru: Сбросить динамические настройки

# gui/panels/CorrectionPanel/default/tooltip
source: Aim correction info panel.
ru_ru: Панель информации корректировщика дальномера.

# gui/panels/CorrectionPanel/default/text
source: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Distance locked: {manualInfo:.1f}m.</font></p>
ru_ru: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Дальномер: {manualInfo:.1f}м.</font></p>

# gui/panels/CorrectionPanel/arcade/text
source: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Distance locked: {manualInfo:.1f}m.</font></p>
ru_ru: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Дальномер: {manualInfo:.1f}м.</font></p>

# gui/panels/CorrectionPanel/sniper/text
source: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Distance locked: {manualInfo:.1f}m.</font></p>
ru_ru: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Дальномер: {manualInfo:.1f}м.</font></p>

# gui/panels/CorrectionPanel/strategic/text
source: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Altitude locked: {manualInfo:.1f}m.</font></p>
ru_ru: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Абсолютная высота: {manualInfo:.1f}м.</font></p>

# gui/panels/CorrectionPanel/arty/text
source: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Unknown parameter locked: {manualInfo:.1f}m.</font></p>
ru_ru: <p align='center'><font color='#00FF00' size='20' face='$UniversCondC'>Неопределенный параметр: {manualInfo:.1f}м.</font></p>

# gui/panels/TargetPanel/default/tooltip
source: Target scanner info panel.
ru_ru: Панель информации сканера целей.

# gui/panels/TargetPanel/default/text
source: <p align='center'><font color='#FF7F00' size='20' face='$UniversCondC'>Target: {shortName}; Distance: {distance:.1f}m; Speed: {speedMS:.1f}m/s.</font></p>
ru_ru: <p align='center'><font color='#FF7F00' size='20' face='$UniversCondC'>Цель: {shortName}; Дистанция: {distance:.1f}м; Скорость: {speedMS:.1f}м/с.</font></p>

# gui/panels/AimingPanel/default/tooltip
source: Aiming info panel.
ru_ru: Панель информации о сведении.

# gui/panels/AimingPanel/default/text
source: <textformat leftmargin='20' rightmargin='20' tabstops='[0,70]'><font color='#64F0B4' size='20' face='$UniversCondC'> Remains: {remainingAimingTime:.2f}s; Distance: {aimingDistance:.1f}m; Deviation: {deviation:.2f}m; Fly time: {flyTime:.2f}s; Hit angle: {hitAngleDeg:+.1f}dg;</font></textformat>
ru_ru: <textformat leftmargin='20' rightmargin='20' tabstops='[0,105]'><font color='#64F0B4' size='20' face='$UniversCondC'> Осталось: {remainingAimingTime:.2f}с; Расстояние: {aimingDistance:.1f}м; Разброс: {deviation:.2f}м; Время полета: {flyTime:.2f}с; Угол падения: {hitAngleDeg:+.1f}°;</font></textformat>

# gui/panels/AimingPanel/arcade/text
source: <textformat leftmargin='20' rightmargin='20' tabstops='[0,70]'><font color='#64F0B4' size='20' face='$UniversCondC'> Remains: {remainingAimingTime:.2f}s; Distance: {aimingDistance:.1f}m; Deviation: {deviation:.2f}m; Fly time: {flyTime:.2f}s; Hit angle: {hitAngleDeg:+.1f}dg;</font></textformat>
ru_ru: <textformat leftmargin='20' rightmargin='20' tabstops='[0,105]'><font color='#64F0B4' size='20' face='$UniversCondC'> Осталось: {remainingAimingTime:.2f}с; Расстояние: {aimingDistance:.1f}м; Разброс: {deviation:.2f}м; Время полета: {flyTime:.2f}с; Угол падения: {hitAngleDeg:+.1f}°;</font></textformat>

# gui/panels/AimingPanel/sniper/text
source: <textformat leftmargin='20' rightmargin='20' tabstops='[0,70]'><font color='#64B4F0' size='20' face='$UniversCondC'> Remains: {remainingAimingTime:.2f}s; Distance: {aimingDistance:.1f}m; Deviation: {deviation:.2f}m; Fly time: {flyTime:.2f}s; Hit angle: {hitAngleDeg:+.1f}dg;</font></textformat>
ru_ru: <textformat leftmargin='20' rightmargin='20' tabstops='[0,105]'><font color='#64B4F0' size='20' face='$UniversCondC'> Осталось: {remainingAimingTime:.2f}с; Расстояние: {aimingDistance:.1f}м; Разброс: {deviation:.2f}м; Время полета: {flyTime:.2f}с; Угол падения: {hitAngleDeg:+.1f}°;</font></textformat>

# gui/panels/AimingPanel/strategic/text
source: <textformat leftmargin='20' rightmargin='20' tabstops='[0,70]'><font color='#B46464' size='20' face='$UniversCondC'> Remains: {remainingAimingTime:.2f}s; Distance: {aimingDistance:.1f}m; Deviation: {deviation:.2f}m; Fly time: {flyTime:.2f}s; Hit angle: {hitAngleDeg:+.1f}dg;</font></textformat>
ru_ru: <textformat leftmargin='20' rightmargin='20' tabstops='[0,105]'><font color='#B46464' size='20' face='$UniversCondC'> Осталось: {remainingAimingTime:.2f}с; Расстояние: {aimingDistance:.1f}м; Разброс: {deviation:.2f}м; Время полета: {flyTime:.2f}с; Угол падения: {hitAngleDeg:+.1f}°;</font></textformat>

# gui/panels/AimingPanel/arty/text
source: <textformat leftmargin='20' rightmargin='20' tabstops='[0,70]'><font color='#B46464' size='20' face='$UniversCondC'> Remains: {remainingAimingTime:.2f}s; Distance: {aimingDistance:.1f}m; Deviation: {deviation:.2f}m; Fly time: {flyTime:.2f}s; Hit angle: {hitAngleDeg:+.1f}dg;</font></textformat>
ru_ru: <textformat leftmargin='20' rightmargin='20' tabstops='[0,105]'><font color='#B46464' size='20' face='$UniversCondC'> Осталось: {remainingAimingTime:.2f}с; Расстояние: {aimingDistance:.1f}м; Разброс: {deviation:.2f}м; Время полета: {flyTime:.2f}с; Угол падения: {hitAngleDeg:+.1f}°;</font></textformat>
